// introduction
// Добавляє новий HTMLAllCollection, зміна існуючогоб модифікація стилів
// Реагування на дії користувача
// Відправляти мережеві запити на сервер скачувати і загружати файли
// Отримувати і встановлювати кукі задавати і показувати повідомлення
// Запамятовувати дані на стороні клієнта local storage

// Не може з веб сторінки отримати доступ до даних на жосткому диску і функціям ОС

вісім типів даних:
-число;//1
-bigInt;//2
-рядок;//3
-Boolean;//4
-null;//5
-undefined;//6
-Symbol;//7
-Object;//8














